export const comandsTerminalItems = [
  {
    nameText: 'exit',
    text: 'Завершує сеанс термінала',
  },

  {
    nameText: 'pwd',
    text: 'Показує поточне місцезнаходження у файловій структурі',
  },

  {
    nameText: 'ls',
    text: 'Виводить список файлів і папок у поточній робочій директорії',
  },

  {
    nameText: 'ls -l',
    text: 'Виводить детальний список файлів у поточній директорії з додатковою інформацією про розмір, дату та час модифікації',
  },

  {
    nameText: 'ls -la',
    text: 'Показує всі приховані файли',
  },

  {
    nameText: 'cd [ім`я директорії]',
    text: 'Показує всі приховані файли',
  },

  {
    nameText: 'cd ..',
    text: 'Переміщує назад на один рівень (вкладеність, папку), тобто до попередньої директорії',
  },

  {
    nameText: 'cd [ім`я директорії]',
    text: 'Переміщує вперед, тобто до вкладеної директорії',
  },

  {
    nameText: 'cd ~',
    text: 'Повертає в кореневу директорію',
  },

  {
    nameText: 'mkdir [ім`я директорії]',
    text: 'Створює нову папку в поточній директорії',
  },

  {
    nameText: 'touch [ім`я файлу] (MacOS) або New-Item [ім`я файлу] (Windows)',
    text: 'Створює порожній файл у поточній директорії',
  },

  {
    nameText:
      'rmdir [ім`я директорії] (MacOS) або Remove-Item [ім`я директорії] (Windows)',
    text: 'Видаляє порожні папки',
  },

  {
    nameText:
      'rm -rf [ім`я директорії] (MacOS) або Remove-Item -rf [ім`я директорії] (Windows)',
    text: 'Видаляє будь-які папки (порожні чи ні)',
  },

  {
    nameText:
      'rm -f [ім`я директорії] (MacOS) або Remove-Item -f [ім`я директорії] (Windows)',
    text: 'Видаляє директорію та всі її вкладені файли та піддиректорії без додаткового підтвердження від користувача',
  },

  {
    nameText: 'mv [джерело] [призначення]',
    text: 'Переміщує/перейменовує папки і файли',
  },

  {
    nameText: 'cp [джерело] [призначення]',
    text: 'Створює копію файлу або папки зі вмістом в новому місці',
  },

  {
    nameText: 'clear',
    text: 'Очищує вміст екрана',
  },
];
